{
    "routes": [
        {
            "path": "/istqb",
            "logo": "../assets/ISTQB.png",
            "name": "Formation Test Manuel: ISTQB Foundation level ",
            "previewText": "Devenez expert du test logiciel en apprenant les bases de test ",
            "description": [
                "Cette formation vous forme pour devenir ISTQB (International Software Testing Qualifications Board) testeur niveau fondation. Elle vous permettra d’acquérir la terminologie des tests ISTQB ainsi que maîtriser les compétences et les bonnes pratiques des tests pour qu’ils soient efficaces. A la fin de cette formation, vous comprendrez les techniques de conceptions de tests principales."
            ],
            "pedagogique": "Formation théorique avec quelques exercices de pratique",
            "objectif": [
                "Acquérir la terminologie ISTQB des tests",
                "Connaître les types de test, leurs caractéristiques, leurs choix et leurs mises en œuvre dans les cycles de vie logiciel",
                "Maîtriser l'ensemble des activités d'un processus de test",
                "Appréhender les techniques et méthodes de tests",
                "Maîtriser les compétences et bonnes pratiques du métier du Tests.  Identifier les outils disponibles et connaître leurs caractéristiques",
                "Réussir l’examen Testeur ISTQB Fondation basée sur le référentiel en version 2018"
            ],
            "cible": [
                "en reconversion professionnelle",
                "impliqué dans les tests de logiciels",
                "chefs de projet",
                "développeurs",
                "responsables qualité"
            ],
            "prereq": {
                "essential": [
                    "pas de prérequis"
                ],
                "preferred": [
                    "cycle de vie des logiciels",
                    "programmation"
                ]
            },
            "duration": "5 jours / 25 heures "
        },
        {
            "path": "/softskills",
            "logo": "../assets/soft.png",
            "name": "Formation Soft Skills pour l’embauche",
            "previewText": "Développez vos soft skills pour une meilleure intégration dans l’entreprise d’aujourd’hui !  ",
            "description": [
                "Parce qu’après les compétences techniques les employeurs portent de plus en plus d'intérêt au Soft Skills, cette formation est conçue pour remédier au gap des profils portant “both hard and soft skills” ",
                "C’est une formation enrichissante basée sur un outil d’évaluation comportementale et des thématiques spécifiques qui permettent de conquérir des aptitudes à vulgariser l’information, communiquer avec différentes parties prenantes et énoncer un message limpide."
            ],
            "pedagogique": "Mise en situation / Exercices / Workshops",
            "objectif": [
                "Se connaître et connaître l’autre pour une meilleure introduction à la vie professionnelle",
                "Développer les Soft Skills nécessaire pour intégrer l’entreprise d’aujourd’hui",
                "Augmenter les chances des participants à réussir leurs entretiens d’embauche",
                "Apprendre à argumenter sur ses connaissances et son parcours professionnel"
            ],
            "cible": [
                "en reconversion professionnelle",
                "jeunes diplômés "
            ],
            "prereq": {
                "essential": [
                    "pas de prérequis"
                ],
                "preferred": []
            },
            "duration": "2 jours / 10 heures"
        },
        {
            "path": "/rpa",
            "logo": "../assets/rpa.png",
            "name": "Formation RPA (robotisation automatisée des processus) ",
            "previewText": "Commencez l’Automatisation des processus métier : les enjeux et le fonctionnement de l’automatisation intelligente ! Coming soon !  ",
            "description": [
                "La meilleure façon d'obtenir une automatisation intelligente est d'apprendre la RPA. Il s'agit d'un type d'apprentissage basé sur l'expérience. ",
                "C’est une formation enrichissante basée sur un outil d’évaluation comportementale et des thématiques spécifiques qui permettent de conquérir des aptitudes à vulgariser l’information, communiquer avec différentes parties prenantes et énoncer un message limpide.",
                "Cette formation sur l'automatisation robotisée des processus vous préparera au métier de bot developer en vous apprenant à automatiser les tâches qui s’avèrent répétitives par la conception des bots qui exécutent le workflow à la place des humains.",
                "Les outils RPA présents sur le marché d'aujourd'hui incluent des fonctionnalités d'IA et de ML dans leurs fonctionnalités pour augmenter l'impact créé par la RPA dans divers secteurs tels que la banque, la finance, la fabrication, etc."
            ],
            "pedagogique": "Apprentissage par projet.",
            "objectif": [
                "Maîtriser l’outil RPA",
                "Comprendre les utilisations et les limites d’un projet RPA",
                "Réaliser un projet RPA de A jusqu’à Z"
            ],
            "cible": [
                "Enthusiaste RPA",
                "Chef de projet",
                "Maitrise d'ouvrage"
            ],
            "prereq": {
                "essential": [
                    "pas de prérequis"
                ],
                "preferred": []
            },
            "duration": "3 semaines / 50 heures"
        },
        {
            "path": "/scrummaster",
            "logo": "../assets/scrum.png",
            "name": "Formation Agilité et Scrum Master",
            "previewText": "Découvrez les méthodes agiles et préparez vous à la certification Scrum Master !",
            "description": [
                "C’est une formation de préparation à la certification Professional Scrum Master1 qui permet d’appréhender les étapes et outils d’une démarche Agile (Scrum) et de la corriger aux bons moments dans l'avancement des projets. ",
                "A la fin de cette formation, l’apprenant sera doté des éléments de base à mettre en place pour assurer son rôle de Scrum Master."
            ],
            "pedagogique": "Méthode participative / Ateliers / Mise en situation ",
            "objectif": [
                "Coordonner les différents rôles de l'équipe Scrum ",
                "Conduire un projet avec une démarche incrémentale et itérative",
                "Prévoir les itérations pendant la sprint planning ",
                "Planifier la daily scrum à partir du sprint backlog ",
                "Évaluer l'atteinte des objectifs lors de la sprint review ",
                "Promouvoir les bonnes pratiques lors de la sprint retrospective ",
                "Guider le raffinage du product backlog pour l’équipe Scrum"
            ],
            "cible": [
                "Chefs de projets",
                "Développeurs",
                "Consultants",
                "Architectes",
                "Managers"
            ],
            "prereq": {
                "essential": [
                    "pas de prérequis"
                ],
                "preferred": []
            },
            "duration": "3 jours / 15 heures"
        },
        {
            "path": "/selenium",
            "logo": "../assets/selenium.jfif",
            "name": "Formation Sélénium ",
            "previewText": "Apprenez à automatiser les tests fonctionnels des applications Web !",
            "description": [
                "C’est une formation de préparation à la Certification A4Q Sélénium Testeur niveau fondation qui aborde les concepts fondamentaux d'automatisation des tests d'interface graphique d'application à l'aide de Selenium WebDriver.",
                "A la fin de cette formation, l’apprenant sera en mesure de créer et exécuter des tests Selenium Webdriver d’une façon autonome."
            ],
            "pedagogique": "Formation théorique et pratique / en mode projet",
            "objectif": [
                "Appliquer correctement les principes d’automatisation de test pour créer une solution d’automatisation de test maintenable",
                "Être capable de choisir et de mettre en oeuvre les outils d’automatisation de test appropriés",
                "Implémenter des scripts Webdriver Selenium pour des tests fonctionnels Web.",
                "Comprendre les principaux objets impliqués dans la recherche de bugs."
            ],
            "cible": [
                "Testeurs automatique",
                "Ingénieurs de test",
                "développeurs"
            ],
            "prereq": {
                "essential": [
                    "Programmation"
                ],
                "preferred": [
                    "Java",
                    "HTML"
                ]
            },
            "duration": "6 jours / 30 heures"
        }
    ]
}